html/v2ray/transport/mkcp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mKCP</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="mux.html"> UP </a>
 |
 <a accesskey="H" href="transport.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">mKCP</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org97575ed">配置</a>
<ul>
<li><a href="#org80a3fc0">服务器</a></li>
<li><a href="#org6ab57e5">客户端</a></li>
</ul>
</li>
<li><a href="#org75d1f93">说明</a></li>
</ul>
</div>
</div>
<p>
V2Ray 引入了 KCP 传输协议，并且做了一些不同的优化，称为 <span class="underline">mKCP</span> 。如果发现网络环境丢包严重，可以考虑一下使用 mKCP。由于快速重传的机制，相对于常规的 TCP 来说，mKCP 在高丢包率的网络下具有更大的优势
</p>

<pre class="example" id="org59d4095">
也正是因为此， mKCP 明显会比 TCP 耗费更多的流量，所以请酌情使用

要了解的一点是，mKCP 与 KCPTUN 同样是 KCP 协议，但两者并不兼容
</pre>
<div id="outline-container-org97575ed" class="outline-2">
<h2 id="org97575ed">配置</h2>
<div class="outline-text-2" id="text-org97575ed">
<p>
mKCP 的配置比较简单，只需在服务器的 inbounds 和 客户端的 outbounds 添加一个 streamSettings 并设置成 mkcp 即可
</p>
</div>
<div id="outline-container-org80a3fc0" class="outline-3">
<h3 id="org80a3fc0">服务器</h3>
<div class="outline-text-3" id="text-org80a3fc0">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 16823,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"clients"</span>: [
                    {
                        <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                        <span style="color: #ffa07a;">"alterId"</span>: 64
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>: {
                <span style="color: #ffa07a;">"network"</span>: <span style="color: #ffa07a;">"mkcp"</span>, <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#27492;&#22788;&#30340; mkcp &#20063;&#21487;&#20889;&#25104; kcp&#65292;&#20004;&#31181;&#20889;&#27861;&#26159;&#36215;&#21516;&#26679;&#30340;&#25928;&#26524;</span>
                <span style="color: #ffa07a;">"kcpSettings"</span>: {
                    <span style="color: #ffa07a;">"uplinkCapacity"</span>: 5,
                    <span style="color: #ffa07a;">"downlinkCapacity"</span>: 100,
                    <span style="color: #ffa07a;">"congestion"</span>: <span style="color: #7fffd4;">true</span>,
                    <span style="color: #ffa07a;">"header"</span>: {
                        <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"none"</span>
                    }
                }
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {}
        }
    ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ab57e5" class="outline-3">
<h3 id="org6ab57e5">客户端</h3>
<div class="outline-text-3" id="text-org6ab57e5">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 1080,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"socks"</span>,
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [<span style="color: #ffa07a;">"http"</span>, <span style="color: #ffa07a;">"tls"</span>]
            },
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"auth"</span>: <span style="color: #ffa07a;">"noauth"</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"vnext"</span>: [
                    {
                        <span style="color: #ffa07a;">"address"</span>: <span style="color: #ffa07a;">"serveraddr.com"</span>,
                        <span style="color: #ffa07a;">"port"</span>: 16823,
                        <span style="color: #ffa07a;">"users"</span>: [
                            {
                                <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                                <span style="color: #ffa07a;">"alterId"</span>: 64
                            }
                        ]
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>: {
                <span style="color: #ffa07a;">"network"</span>: <span style="color: #ffa07a;">"mkcp"</span>,
                <span style="color: #ffa07a;">"kcpSettings"</span>: {
                    <span style="color: #ffa07a;">"uplinkCapacity"</span>: 5,
                    <span style="color: #ffa07a;">"downlinkCapacity"</span>: 100,
                    <span style="color: #ffa07a;">"congestion"</span>: <span style="color: #7fffd4;">true</span>,
                    <span style="color: #ffa07a;">"header"</span>: {
                        <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"none"</span>
                    }
                }
            }
        }
    ]
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org75d1f93" class="outline-2">
<h2 id="org75d1f93">说明</h2>
<div class="outline-text-2" id="text-org75d1f93">
<p>
在上面的配置当中，与之前相比主要的变化在于多了一个 <b>streamSettings</b> ，包含有不少参数：
</p>
<ul class="org-ul">
<li>network: 网络的选择，要像上面的配置写成 kcp 或 mkcp 才会启用 mKCP</li>
<li>kcpSettings: 包含一些关于 mKCP 设置的参数，有
<ul class="org-ul">
<li>uplinkCapacity: 上行链路容量，将决定 V2Ray 向外发送数据包的速率。单位为 MB</li>
<li>downlinkCapacity：下行链路容量，将决定 V2Ray 接收数据包的速率。单位同样是 MB</li>
<li>header：对于数据包的伪装
<ul class="org-ul">
<li>type：要伪装成的数据包类型</li>
</ul></li>
</ul></li>
</ul>

<p>
客户端的上行对于服务器来说是下行，同样地客户端的下行是服务器的上行，mKCP 设置当中服务器和客户端都有 uplinkCapacity 和 downlinkCapacity，所以客户端的上传速率由服务器的 downlinkCapacity 和客户端的 uplinkCapacity 中的最小值决定，客户端的下载速率也是同样的道理
</p>
<pre class="example" id="org7beef55">
因此，建议将服务器和客户端的 downlinkCapacity 设成一个很大的值，然后分别修改两端的 uplinkCapacity 以调整上下行速率
</pre>

<p>
还有一个 header 参数可以对 mKCP 进行伪装，这是 mKCP 的一个优势。具体的伪装类型在 type 参数设置，type 可以设置成 <span class="underline">utp</span> 、 <span class="underline">srtp</span> 、 <span class="underline">wechat-video</span> 、 <span class="underline">dtls</span> 、 <span class="underline">wireguard</span> 或者 <span class="underline">none</span> ，这几个分别将 mKCP 数据伪装成 BT 下载、视频通话、微信视频通话、dtls、wireguard(一种新型 VPN)以及不进行伪装。 <b>这里的 type 参数，客户端与服务器要一致。还有要时刻记住伪装仅仅是伪装</b>
</p>

<pre class="example" id="orgacb87f9">
至于上述配置里有但是没有说明的参数，是 V2Ray 的默认值

个人建议是保持默认。如果需要了解或者修改，请参考手册
</pre>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="dynamic_port.html">Next：动态端口</a></td>
<td class="org-left"><a href="mux.html">Previous: Mux</a></td>
<td class="org-left"><a href="transport.html">Home：传输</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
